In [2]:
import pandas as pd
import numpy as np

# Series

In [4]:
s = pd.Series([1,2,3,4])

In [5]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
s = pd.Series([1,2,3,4],index=['a','b','c','d'],name="first series",dtype="float")

In [15]:
s

a    1.0
b    2.0
c    3.0
d    4.0
Name: first series, dtype: float64

# Dataframe

In [63]:
df = pd.DataFrame([[1,2,3],[4,5,6]])

In [64]:
df

   0  1  2
0  1  2  3
1  4  5  6

In [67]:
df = pd.DataFrame([[1,2,3],[4,5,6]],columns=["A","B","C"])

In [68]:
df

   A  B  C
0  1  2  3
1  4  5  6

In [76]:
df = pd.DataFrame(np.arange(10).reshape(5,2),columns=['A','B'],index=np.arange(1,6))

In [77]:
df

   A  B
1  0  1
2  2  3
3  4  5
4  6  7
5  8  9

In [78]:
#Different ways of creating dataframe

In [79]:
l = [["Batman",50],["Superman",80],["Iron man",3000],["Thor",200]]

In [80]:
l

[['Batman', 50], ['Superman', 80], ['Iron man', 3000], ['Thor', 200]]

In [82]:
pd.DataFrame(l,columns=["Hero","Power"])

       Hero  Power
0    Batman     50
1  Superman     80
2  Iron man   3000
3      Thor    200

In [90]:
dic = {'hero':["Batman","Superman","Ironman"],'power':[50,80,3000]}

In [91]:
dic

{'hero': ['Batman', 'Superman', 'Ironman'], 'power': [50, 80, 3000]}

In [92]:
pd.DataFrame(dic)

       hero  power
0    Batman     50
1  Superman     80
2   Ironman   3000

In [93]:
dic = [{'hero':'batman','power':30},{'hero':'superman','power':50},{'hero':'ironman','power':3000}]

In [94]:
dic

[{'hero': 'batman', 'power': 30},
 {'hero': 'superman', 'power': 50},
 {'hero': 'ironman', 'power': 3000}]

In [95]:
pd.DataFrame(dic)

       hero  power
0    batman     30
1  superman     50
2   ironman   3000

In [104]:
s1 = pd.Series(np.arange(5),name="series 1")

In [105]:
s1

0    0
1    1
2    2
3    3
4    4
Name: series 1, dtype: int32

In [106]:
s2 = pd.Series(np.arange(5),name="series 2")

In [119]:
s2[0]

1

# Reading Data from various sources

In [112]:
# Reading CSV file

In [113]:
df = pd.read_csv("hero.csv")

In [114]:
df

        name  marks grade
0     batman     90    a+
1   superman     70     a
2  spiderman     80     a

In [117]:
df.name

0       batman
1     superman
2    spiderman
Name: name, dtype: object

In [121]:
df.iloc[0]

name     batman
marks        90
grade        a+
Name: 0, dtype: object

In [123]:
df['name'][0]

'batman'

In [124]:
df.iloc[:]

        name  marks grade
0     batman     90    a+
1   superman     70     a
2  spiderman     80     a

In [132]:
df = pd.read_clipboard()

In [133]:
df

,YEAR,WINNERS,RUNNERS-UP,VENUE OF FINAL,PLAYER OF THE SERIES
0,2008,Rajasthan Royals,Chennai Super Kings,Mumbai,Shane Watson
1,2009,Deccan Chargers,Royal Challengers Bangalore,Johannesburg,Adam Gilchrist
2,2010,Chennai Super Kings,Mumbai Indians,Mumbai,Sachin Tendulkar
3,2011,Chennai Super Kings,Royal Challengers Bangalore,Chennai,Chris Gayle
4,2012,Kolkata Knight Riders,Chennai Super Kings,Chennai,Sunil Narine
5,2013,Mumbai Indians,Chennai Super Kings,Kolkata,Shane Watson
6,2014,Kolkata Knight Riders,Kings XI Punjab,Bangalore,Glenn Maxwell
7,2015,Mumbai Indians,Chennai Super Kings,Kolkata,Andre Russell
8,2016,Sunrisers Hyderabad,Royal Challengers Bangalore,Bangalore,Virat Kohli
9,2017,Mumbai Indians,Rising Pune Supergiants,Hyderabad,Ben Stokes
10,2018,Chennai Super Kings,Sunrisers Hyderabad,Mumbai,Sunil Narine

In [135]:
df.drop(['PLAYER OF THE SERIES'],axis=1)

    YEAR                WINNERS                   RUNNERS-UP VENUE OF FINAL
0   2008       Rajasthan Royals          Chennai Super Kings         Mumbai
1   2009        Deccan Chargers  Royal Challengers Bangalore   Johannesburg
2   2010    Chennai Super Kings               Mumbai Indians         Mumbai
3   2011    Chennai Super Kings  Royal Challengers Bangalore        Chennai
4   2012  Kolkata Knight Riders          Chennai Super Kings        Chennai
5   2013         Mumbai Indians          Chennai Super Kings        Kolkata
6   2014  Kolkata Knight Riders              Kings XI Punjab      Bangalore
7   2015         Mumbai Indians          Chennai Super Kings        Kolkata
8   2016    Sunrisers Hyderabad  Royal Challengers Bangalore      Bangalore
9   2017         Mumbai Indians      Rising Pune Supergiants      Hyderabad
10  2018    Chennai Super Kings          Sunrisers Hyderabad         Mumbai

In [136]:
df.drop([10])

,YEAR,WINNERS,RUNNERS-UP,VENUE OF FINAL,PLAYER OF THE SERIES
0,2008,Rajasthan Royals,Chennai Super Kings,Mumbai,Shane Watson
1,2009,Deccan Chargers,Royal Challengers Bangalore,Johannesburg,Adam Gilchrist
2,2010,Chennai Super Kings,Mumbai Indians,Mumbai,Sachin Tendulkar
3,2011,Chennai Super Kings,Royal Challengers Bangalore,Chennai,Chris Gayle
4,2012,Kolkata Knight Riders,Chennai Super Kings,Chennai,Sunil Narine
5,2013,Mumbai Indians,Chennai Super Kings,Kolkata,Shane Watson
6,2014,Kolkata Knight Riders,Kings XI Punjab,Bangalore,Glenn Maxwell
7,2015,Mumbai Indians,Chennai Super Kings,Kolkata,Andre Russell
8,2016,Sunrisers Hyderabad,Royal Challengers Bangalore,Bangalore,Virat Kohli
9,2017,Mumbai Indians,Rising Pune Supergiants,Hyderabad,Ben Stokes

In [138]:
df.columns

Index(['YEAR', 'WINNERS', 'RUNNERS-UP', 'VENUE OF FINAL',
       'PLAYER OF THE SERIES'],
      dtype='object')

In [148]:
df.rename(columns={'VENUE OF FINAL':'VENUE','PLAYER OF THE SERIES':'POS'},inplace=True)

In [156]:
df['WINNERS'].unique()

array(['Rajasthan Royals', 'Deccan Chargers', 'Chennai Super Kings',
       'Kolkata Knight Riders', 'Mumbai Indians', 'Sunrisers Hyderabad'],
      dtype=object)

In [157]:
df['RUNNERS-UP'].unique()

array(['Chennai Super Kings', 'Royal Challengers Bangalore',
       'Mumbai Indians', 'Kings XI Punjab', 'Rising Pune Supergiants',
       'Sunrisers Hyderabad'], dtype=object)